<?php
return array(

// 动作			积分    金币
// 注册			+20	+20
// 上传头像		+20	+20
	
// 邀请注册		+10	+5
// 邀请活动		+10	+5

// 小组发帖		+5	+2
// 回复帖子		+2	+1

// 关注平台		+2	+0
// 关联平台		+2	+0
// 点赞活动		+2	+0

// 实名验证		+10	+10
// 邮箱验证		+10	+10
// 大V验证		+1000	+1000

	//	1增加  -消耗
	'credit'=>array(
		//'名称'=>array(分组，内容，积分，金币);
		'register'    =>  array( 1 , '注册' ,        20  ,  20),	//	
		'avatar'      =>  array( 1 , '上传头像' ,  20  ,  20),	//		
		'invite_reg'       =>  array( 2 , '邀请注册' ,  10  ,  5), //		
		'invite_event'        =>  array( 2 , '邀请活动' ,  10  ,  5), //
		'add_topic'         =>  array( 3 , '小组发帖' ,  5    ,  2), //
		'reply_topic' =>  array( 3 , '回复帖子' ,  2     , 1),  //
		'like_com'  =>  array( 4 , '关注平台' ,  2     , 0), //
		'relation_com'        =>  array( 4 , '关联平台' ,  2     , 0), //
		'like_event'        =>  array( 4 , '点赞活动' ,  2     , 0), //
		'real_name'        =>  array( 1 , '实名验证' ,  10    ,10),
		'real_email'        =>  array( 1 , '邮箱验证' ,  10    ,10),
		'user_v'        =>  array( 1 , '大V验证' ,   1000 ,1000),
	),

	'credit_level' => array(
		'LV1' => 30,
		'LV2' => 80,
		'LV3' => 150,
		'LV4' => 250,
		'LV5' => 500,
		'LV6' => 1000,
		'LV7' => 2000,
		'LV8' => 4000,
		'LV9' => 7000,
		'LV10' => 10000,
		'LV11' => 15000,
	),	


);

